espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/examples/ble_peripheral/ble_app_cts_c/main.c
static const char * day_of_week[8]    = {"Unknown",
                                         "Monday",
                                         "Tuesday",
                                         "Wednesday",
                                         "Thursday",
                                         "Friday",
                                         "Saturday",
                                         "Sunday"};

static const char * month_of_year[13] = {"Unknown",
                                         "January",
                                         "February",
                                         "March",
                                         "April",
                                         "May",
                                         "June",
                                         "July",
                                         "August",
                                         "September",
                                         "October",
                                         "November",
                                         "December"};


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num  Line number of the failing ASSERT call.
 * @param[in] file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling the Current Time Service errors.
 *
 * @param[in]  nrf_error  Error code containing information about what went wrong.
 */
static void current_time_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling UART errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}


/**@brief Function for handling the security request timer time-out.
 *
 * @details This function will be called each time the security request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the time-out handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t             err_code;
    dm_security_status_t status;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = dm_security_status_req(&m_peer_handle, &status);
        APP_ERROR_CHECK(err_code);

        // If the link is still not secured by the peer, initiate security procedure.
        if (status == NOT_ENCRYPTED)
        {
            err_code = dm_security_setup_req(&m_peer_handle);
            APP_ERROR_CHECK(err_code);
        }
    }
}


/**@brief Function for handling the Current Time Service errors.
 *
 * @param[in] p_evt  Event received from the Current Time Service client.
 */
static void current_time_print(ble_cts_c_evt_t * p_evt)
{
    printf("\nCurrent Time:\n");
    printf("\nDate:\n");

    printf("\tDay of week   %s\n", day_of_week[p_evt->
                                               params.
                                               current_time.
                                               exact_time_256.
                                               day_date_time.
                                               day_of_week]);

    if (p_evt->params.current_time.exact_time_256.day_date_time.date_time.day == 0)
    {
        printf("\tDay of month  Unknown\n");
    }
    else
    {
        printf("\tDay of month  %i\n",
               p_evt->params.current_time.exact_time_256.day_date_time.date_time.day);
    }

    printf("\tMonth of year %s\n",
           month_of_year[p_evt->params.current_time.exact_time_256.day_date_time.date_time.month]);
    if (p_evt->params.current_time.exact_time_256.day_date_time.date_time.year == 0)
    {
        printf("\tYear          Unknown\n");
    }
    else
    {
        printf("\tYear          %i\n",
               p_evt->params.current_time.exact_time_256.day_date_time.date_time.year);
    }
    printf("\nTime:\n");
    printf("\tHours     %i\n",
           p_evt->params.current_time.exact_time_256.day_date_time.date_time.hours);
    printf("\tMinutes   %i\n",
           p_evt->params.current_time.exact_time_256.day_date_time.date_time.minutes);
    printf("\tSeconds   %i\n",
           p_evt->params.current_time.exact_time_256.day_date_time.date_time.seconds);
    printf("\tFractions %i/256 of a second\n",
           p_evt->params.current_time.exact_time_256.fractions256);

    printf("\nAdjust reason:\n");
    printf("\tDaylight savings %x\n",
           p_evt->params.current_time.adjust_reason.change_of_daylight_savings_time);
    printf("\tTime zone        %x\n",
           p_evt->params.current_time.adjust_reason.change_of_time_zone);
    printf("\tExternal update  %x\n",
           p_evt->params.current_time.adjust_reason.external_reference_time_update);
    printf("\tManual update    %x\n",
           p_evt->params.current_time.adjust_reason.manual_time_update);
}


/**@brief Function for the timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);

    // Create security request timer.
    err_code = app_timer_create(&m_sec_req_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                sec_req_timeout_handler);
    APP_ERROR_CHECK(err_code);

